const rolePage = {
    rows: [{
        id: '2016-05-03',
        type: '王小虎'

    }, {
        id: '2016-05-02',
        type: '王小虎'

    }, {
        id: '2016-05-04',
        type: '王小虎'

    }, {
        id: '2016-05-01',
        type: '王小虎'
    }, {
        id: '2016-05-08',
        type: '王小虎'

    }, {
        id: '2016-05-06',
        type: '王小虎',
    }, {
        id: '2016-05-07',
        type: '王小虎'
    }, {
        id: '2016-05-04',
        type: '王小虎'

    }, {
        id: '2016-05-01',
        type: '王小虎'
    }, {
        id: '2016-05-08',
        type: '王小虎'

    }, {
        id: '2016-05-06',
        type: '王小虎',
    }, {
        id: '2016-05-07',
        type: '王小虎'
    }, {
        id: '2016-05-04',
        type: '王小虎'

    }, {
        id: '2016-05-01',
        type: '王小虎'
    }, {
        id: '2016-05-08',
        type: '王小虎'

    }, {
        id: '2016-05-06',
        type: '王小虎',
    }, {
        id: '2016-05-07',
        type: '王小虎'
    }, {
        id: '2016-05-04',
        type: '王小虎'

    }, {
        id: '2016-05-01',
        type: '王小虎'
    }, {
        id: '2016-05-08',
        type: '王小虎'

    }, {
        id: '2016-05-06',
        type: '王小虎',
    }, {
        id: '2016-05-07',
        type: '王小虎'
    }],
    total: 500
}

export default [
    {
        path: '/api/pageRole',
        method: 'post',
        handle({body}) {
            return {
                retCode: '000000',
                retDesc: '查询成功',
                data: rolePage
            }

        }
    }

]